In [5]:
import pandas as pd;
import numpy as np;
data=pd.Series(['india','pakistan',np.nan,'japan','chaina'])
data

0       india
1    pakistan
2         NaN
3       japan
4      chaina
dtype: object

In [6]:
np.nan

nan

In [7]:
data.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [20]:
data[0]=None
data
#data.isnull()

0        None
1    pakistan
2         NaN
3       japan
4      chaina
dtype: object

In [21]:
data.isnull()

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [22]:
from numpy import nan as NA;
data=pd.Series([22,NA,33,NA,44])
data

0    22.0
1     NaN
2    33.0
3     NaN
4    44.0
dtype: float64

In [24]:
data.dropna()

0    22.0
2    33.0
4    44.0
dtype: float64

In [26]:
data[data.notnull()]  #another way

0    22.0
2    33.0
4    44.0
dtype: float64

In [28]:
data=pd.DataFrame([[1.,2.,3],[2,NA,NA],[NA,NA,NA],[9,10,NA]])
data

     0     1    2
0  1.0   2.0  3.0
1  2.0   NaN  NaN
2  NaN   NaN  NaN
3  9.0  10.0  NaN

In [29]:
data.dropna()

     0    1    2
0  1.0  2.0  3.0

In [36]:
data.dropna(how='all') #drops only all null value row

     0     1    2
0  1.0   2.0  3.0
1  2.0   NaN  NaN
3  9.0  10.0  NaN

In [39]:
data.dropna(how='all',axis=1) #drops columwise all null

     0     1    2
0  1.0   2.0  3.0
1  2.0   NaN  NaN
2  NaN   NaN  NaN
3  9.0  10.0  NaN

In [61]:
df=pd.DataFrame(np.random.randn(6,3)) #randn=random normal distribution
df                                    #6*3 array of RD values

          0         1         2
0  0.296944 -0.418039 -0.953947
1 -1.276200 -1.461372 -0.433462
2 -0.258637 -0.983745  0.868742
3 -0.018761 -0.240479  1.221459
4 -1.216076 -1.458462 -0.818085
5 -1.455403  0.982638  0.158226

In [62]:
df.iloc[:5,0]=NA
df.iloc[:3,2]=NA
df

          0         1         2
0       NaN -0.418039       NaN
1       NaN -1.461372       NaN
2       NaN -0.983745       NaN
3       NaN -0.240479  1.221459
4       NaN -1.458462 -0.818085
5 -1.455403  0.982638  0.158226

In [63]:
#df.loc[:5,0]=NA
#df.loc[:3,2]=NA
#df

In [64]:
df.dropna()

          0         1         2
5 -1.455403  0.982638  0.158226

In [65]:
df.dropna(thresh=2)

          0         1         2
3       NaN -0.240479  1.221459
4       NaN -1.458462 -0.818085
5 -1.455403  0.982638  0.158226

In [74]:
df.dropna(thresh=2,axis=1) #columwise >=2 numbered colums

          1         2
0 -0.418039       NaN
1 -1.461372       NaN
2 -0.983745       NaN
3 -0.240479  1.221459
4 -1.458462 -0.818085
5  0.982638  0.158226

In [87]:
df.fillna(np.random.randint(99))

           0         1          2
0  53.000000 -0.418039  53.000000
1  53.000000 -1.461372  53.000000
2  53.000000 -0.983745  53.000000
3  53.000000 -0.240479   1.221459
4  53.000000 -1.458462  -0.818085
5  -1.455403  0.982638   0.158226

In [88]:
df.fillna({0:0.5,2:1.5})

          0         1         2
0  0.500000 -0.418039  1.500000
1  0.500000 -1.461372  1.500000
2  0.500000 -0.983745  1.500000
3  0.500000 -0.240479  1.221459
4  0.500000 -1.458462 -0.818085
5 -1.455403  0.982638  0.158226

In [91]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.000000 -0.418039  0.000000
1  0.000000 -1.461372  0.000000
2  0.000000 -0.983745  0.000000
3  0.000000 -0.240479  1.221459
4  0.000000 -1.458462 -0.818085
5 -1.455403  0.982638  0.158226

In [95]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.322689  0.385281  0.035993
1 -0.318532 -0.534790 -0.109736
2  0.101630       NaN -0.127029
3 -0.254056       NaN -0.310931
4 -0.186159       NaN       NaN
5 -1.730018       NaN       NaN

In [96]:
df.fillna(method='ffill')

          0         1         2
0  0.322689  0.385281  0.035993
1 -0.318532 -0.534790 -0.109736
2  0.101630 -0.534790 -0.127029
3 -0.254056 -0.534790 -0.310931
4 -0.186159 -0.534790 -0.310931
5 -1.730018 -0.534790 -0.310931

In [99]:
df.fillna(method='ffill',limit=1)

          0         1         2
0  0.322689  0.385281  0.035993
1 -0.318532 -0.534790 -0.109736
2  0.101630 -0.534790 -0.127029
3 -0.254056       NaN -0.310931
4 -0.186159       NaN -0.310931
5 -1.730018       NaN       NaN